In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import numpy as np

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
train = pd.read_csv("/content/train.csv")
test = pd.read_csv("/content/test.csv")
train_Orginal = train.copy()
test_Orginal = test.copy()

In [3]:
train.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [4]:
train['Sex'] = train['Sex'].replace({'male':0,'female':1})
test['Sex'] = test['Sex'].replace({'male':0,'female':1})

In [5]:
train.head(10)

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S
5            6         0       3  ...   8.4583    NaN         Q
6            7         0       1  ...  51.8625    E46         S
7            8         0       3  ...  21.0750    NaN         S
8            9         1       3  ...  11.1333    NaN         S
9           10         1       2  ...  30.0708    NaN         C

[10 rows x 12 columns]

In [6]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int64
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(6), object(4)
memory usage: 83.7+ KB

In [7]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    int64
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 36.0+ KB

In [8]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [10]:
Target_col = train.Survived
columns_train = ['Age','Pclass','Sex','Fare']

In [11]:
train = train[columns_train]
test = test[columns_train]

In [12]:
train.isnull().sum()

Age       177
Pclass      0
Sex         0
Fare        0
dtype: int64

In [13]:
test.isnull().sum()

Age       86
Pclass     0
Sex        0
Fare       1
dtype: int64

In [14]:
train['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [15]:
train['Age']= train['Age'].fillna(train['Age'].mean())

In [16]:
train.isnull().sum()

Age       0
Pclass    0
Sex       0
Fare      0
dtype: int64

In [17]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     891 non-null    float64
 1   Pclass  891 non-null    int64
 2   Sex     891 non-null    int64
 3   Fare    891 non-null    float64
dtypes: float64(2), int64(2)
memory usage: 28.0 KB

In [18]:
test['Age']= test['Age'].fillna(test['Age'].mean())

In [19]:
test.isnull().sum()

Age       0
Pclass    0
Sex       0
Fare      1
dtype: int64

In [20]:
test['Fare'] = test['Fare'].fillna(test['Fare'].mean())

In [21]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     418 non-null    float64
 1   Pclass  418 non-null    int64
 2   Sex     418 non-null    int64
 3   Fare    418 non-null    float64
dtypes: float64(2), int64(2)
memory usage: 13.2 KB

In [22]:
test.isnull().sum()

Age       0
Pclass    0
Sex       0
Fare      0
dtype: int64

In [23]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     418 non-null    float64
 1   Pclass  418 non-null    int64
 2   Sex     418 non-null    int64
 3   Fare    418 non-null    float64
dtypes: float64(2), int64(2)
memory usage: 13.2 KB

In [24]:
train['Age'] = train['Age'].round(0).astype(int)
train['Fare'] = train['Fare'].round(0).astype(int)
test['Age'] = test['Age'].round(0).astype(int)
test['Fare'] = test['Fare'].round(0).astype(int)

In [25]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     891 non-null    int64
 1   Pclass  891 non-null    int64
 2   Sex     891 non-null    int64
 3   Fare    891 non-null    int64
dtypes: int64(4)
memory usage: 28.0 KB

In [26]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     418 non-null    int64
 1   Pclass  418 non-null    int64
 2   Sex     418 non-null    int64
 3   Fare    418 non-null    int64
dtypes: int64(4)
memory usage: 13.2 KB

In [27]:
train.head(5)

   Age  Pclass  Sex  Fare
0   22       3    0     7
1   38       1    1    71
2   26       3    1     8
3   35       1    1    53
4   35       3    0     8

In [28]:
test.head(5)

   Age  Pclass  Sex  Fare
0   34       3    0     8
1   47       3    1     7
2   62       2    0    10
3   27       3    0     9
4   22       3    1    12

In [29]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from xgboost import XGBClassifier

In [30]:
train_x,valid_x,train_y,valid_y = train_test_split(train,Target_col,test_size = 0.3,random_state =0)

In [31]:
model = XGBClassifier()

In [32]:
model.fit(train_x,train_y)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, gamma=0,
              learning_rate=0.1, max_delta_step=0, max_depth=3,
              min_child_weight=1, missing=None, n_estimators=100, n_jobs=1,
              nthread=None, objective='binary:logistic', random_state=0,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
              silent=None, subsample=1, verbosity=1)

In [33]:
pred = model.predict(valid_x)

In [34]:
print(accuracy_score(valid_y,pred))

0.832089552238806

In [35]:
pred_test = model.predict(test)

In [36]:
submission = pd.DataFrame({'ID': test_Orginal['PassengerId'],'Survived': pred_test})

In [37]:
submission.to_csv("Titanic_XGB.csv")